#include "menu/menu.h"

#include <stdio.h>
#include <stdlib.h>

#include "config.h"
#include "tools/color.h"
#include "tools/hint.h"

// 不同菜单的提示信息
static const char* menuPrompts[MENU_NUM] = {
    "+==============+================+===============+========+\n"
    "| 1) 用户登录 | 2) 用户注册 | 3) 管理员登录 | 4) 退出 |\n"
    "+==============+================+===============+========+\n",

    "+=========+==========+==========+=========+==========+=======+========+\n"
    "| 1) 所有商品 | 2) 搜索商品 | 3) 查看订单 | 4) 所有用户 | 5) 删除用户 | "
    "6) 下架商品 | 7) 返回 |\n"
    "+=========+==========+==========+=========+==========+=======+========+\n",

    "+=========+==========+==============+========+\n"
    "| 1) 我是买家 | 2) 我是卖家 | 3) 个人信息 | 4) 返回 |\n"
    "+=========+==========+==============+========+\n",

    "+=========+=======+==========+=========+===============+========+\n"
    "| 1) 查看在售商品 | 2) 购买商品 | 3) 搜索商品 | 4) 查看订单 | 5) "
    "查看商品信息 "
    "| 6) 返回 |\n"
    "+=========+=======+==========+=========+===============+========+\n",

    "+========+=========+==========+=======+=========+========+\n"
    "| 1) 添加商品 | 2) 我的商品 | 3) 修改商品 | 4) 下架商品 | 5) 查看订单 | "
    "6) 返回 "
    "|\n"
    "+========+=========+==========+=======+=========+========+\n",

    "+===============+==========+==========+========+\n"
    "| 1) 我的信息 | 2) 修改个人信息 | 3) 充值 | 4) 返回 |\n"
    "+===============+==========+==========+========+\n",

    "+============+===========+===========+========+\n"
    "| 1) 修改密码 | 2) 修改联系方式 | 3) 修改地址 | 4) 返回 |\n"
    "+============+===========+===========+========+\n",

    "+========+=========+===============+========+\n"
    "| 1) 修改名称 | 2) 修改价格 | 3) 修改描述 | 4) 返回 |\n"
    "+========+=========+===============+========+\n"};

// 不同菜单的名称
static const char* menuNames[MENU_NUM] = {
    "主", "管理员", "用户", "买家", "卖家", "个人信息", "信息修改", "商品"};

// 所有页面退出操作按钮列表
const int optionNum[MENU_NUM] = {4, 7, 4, 6, 6, 4, 4, 4};

static void promptMessage(Menu type) {
  setPurpleFront();
  printf("\t\t\t%s菜单 \n", menuNames[type]);
  resetFontColor();

  setYellowFront();
  printf("%s\n请选择操作: ", menuPrompts[type]);
  resetFontColor();
}

int menu(Menu type) {
  promptMessage(type);

  char buffer[MAX_LEN];
  int res;
  scanf("%s", buffer);
  res = atoi(buffer);
  while (1) {
    // 选择成功，退出循环
    if (res >= 1 && res <= optionNum[type]) break;
    illegalMessage();
    printf("请重试: ");
    scanf("%s", buffer);
    res = atoi(buffer);
  }

  return res;
}
